In [1]:
###################################
### 1-3 기초 익히기
###################################
import pandas as pd
import numpy as np


s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [2]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [3]:
# 6, 4 의 배열을 만들고 각 컬럼명을 A, B, C, D 로 지정.
# index(row) 는 위에서 지정한 dates 를 사용함
df=pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01  0.818187  1.212508 -0.079337 -1.398542
2013-01-02  0.064196  0.339498 -0.665702  0.449547
2013-01-03  0.683755  1.207175  0.756198 -1.380365
2013-01-04  0.070610 -0.539253 -0.088252  0.056645
2013-01-05  0.775275 -0.722332  0.188264  0.495373
2013-01-06  0.109043  1.232773  2.202899  0.628963

In [4]:
# head 안의 숫자는 보여줄 라인수를 지정. (기본 5행)
df.head(3)

                   A         B         C         D
2013-01-01  0.818187  1.212508 -0.079337 -1.398542
2013-01-02  0.064196  0.339498 -0.665702  0.449547
2013-01-03  0.683755  1.207175  0.756198 -1.380365

In [5]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [7]:
df.values

array([[ 0.81818716,  1.21250834, -0.07933693, -1.39854153],
       [ 0.06419596,  0.33949829, -0.66570175,  0.44954742],
       [ 0.68375493,  1.20717513,  0.75619849, -1.38036527],
       [ 0.07060959, -0.53925339, -0.08825163,  0.05664549],
       [ 0.77527534, -0.72233206,  0.18826368,  0.49537324],
       [ 0.10904285,  1.23277304,  2.20289906,  0.62896345]])

In [8]:
# DateFrame 의 정보를 알 수 있음.
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [9]:
# 통계적 개요를 확인
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.420178  0.455062  0.385678 -0.191396
std    0.374087  0.909121  1.002477  0.947399
min    0.064196 -0.722332 -0.665702 -1.398542
25%    0.080218 -0.319565 -0.086023 -1.021113
50%    0.396399  0.773337  0.054463  0.253096
75%    0.752395  1.211175  0.614215  0.483917
max    0.818187  1.232773  2.202899  0.628963

In [10]:
# B 를 기준으로 정렬. 내림차순
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-06  0.109043  1.232773  2.202899  0.628963
2013-01-01  0.818187  1.212508 -0.079337 -1.398542
2013-01-03  0.683755  1.207175  0.756198 -1.380365
2013-01-02  0.064196  0.339498 -0.665702  0.449547
2013-01-04  0.070610 -0.539253 -0.088252  0.056645
2013-01-05  0.775275 -0.722332  0.188264  0.495373

In [11]:
df['A']

2013-01-01    0.818187
2013-01-02    0.064196
2013-01-03    0.683755
2013-01-04    0.070610
2013-01-05    0.775275
2013-01-06    0.109043
Freq: D, Name: A, dtype: float64

In [12]:
df[0:3]

                   A         B         C         D
2013-01-01  0.818187  1.212508 -0.079337 -1.398542
2013-01-02  0.064196  0.339498 -0.665702  0.449547
2013-01-03  0.683755  1.207175  0.756198 -1.380365

In [13]:
# index 로 범위지정하여 조회
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.064196  0.339498 -0.665702  0.449547
2013-01-03  0.683755  1.207175  0.756198 -1.380365
2013-01-04  0.070610 -0.539253 -0.088252  0.056645

In [14]:
# 0번째 index를 row 단위로 보기
df.loc[dates[0]]

A    0.818187
B    1.212508
C   -0.079337
D   -1.398542
Name: 2013-01-01 00:00:00, dtype: float64

In [15]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.818187  1.212508
2013-01-02  0.064196  0.339498
2013-01-03  0.683755  1.207175
2013-01-04  0.070610 -0.539253
2013-01-05  0.775275 -0.722332
2013-01-06  0.109043  1.232773

In [16]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.064196  0.339498
2013-01-03  0.683755  1.207175
2013-01-04  0.070610 -0.539253

In [17]:
df.loc['20130102', ['A','B']]

A    0.064196
B    0.339498
Name: 2013-01-02 00:00:00, dtype: float64

In [18]:
df.loc[dates[0],'A']

0.8181871591318942

In [19]:
df.iloc[3]

A    0.070610
B   -0.539253
C   -0.088252
D    0.056645
Name: 2013-01-04 00:00:00, dtype: float64

In [20]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.070610 -0.539253
2013-01-05  0.775275 -0.722332

In [21]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.064196 -0.665702
2013-01-03  0.683755  0.756198
2013-01-05  0.775275  0.188264

In [22]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.064196  0.339498 -0.665702  0.449547
2013-01-03  0.683755  1.207175  0.756198 -1.380365

In [23]:
df.iloc[:,1:3]

                   B         C
2013-01-01  1.212508 -0.079337
2013-01-02  0.339498 -0.665702
2013-01-03  1.207175  0.756198
2013-01-04 -0.539253 -0.088252
2013-01-05 -0.722332  0.188264
2013-01-06  1.232773  2.202899

In [24]:
df

                   A         B         C         D
2013-01-01  0.818187  1.212508 -0.079337 -1.398542
2013-01-02  0.064196  0.339498 -0.665702  0.449547
2013-01-03  0.683755  1.207175  0.756198 -1.380365
2013-01-04  0.070610 -0.539253 -0.088252  0.056645
2013-01-05  0.775275 -0.722332  0.188264  0.495373
2013-01-06  0.109043  1.232773  2.202899  0.628963

In [25]:
df[df.A >0]

                   A         B         C         D
2013-01-01  0.818187  1.212508 -0.079337 -1.398542
2013-01-02  0.064196  0.339498 -0.665702  0.449547
2013-01-03  0.683755  1.207175  0.756198 -1.380365
2013-01-04  0.070610 -0.539253 -0.088252  0.056645
2013-01-05  0.775275 -0.722332  0.188264  0.495373
2013-01-06  0.109043  1.232773  2.202899  0.628963

In [26]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.818187  1.212508       NaN       NaN
2013-01-02  0.064196  0.339498       NaN  0.449547
2013-01-03  0.683755  1.207175  0.756198       NaN
2013-01-04  0.070610       NaN       NaN  0.056645
2013-01-05  0.775275       NaN  0.188264  0.495373
2013-01-06  0.109043  1.232773  2.202899  0.628963

In [29]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  0.818187  1.212508 -0.079337 -1.398542    one
2013-01-02  0.064196  0.339498 -0.665702  0.449547    one
2013-01-03  0.683755  1.207175  0.756198 -1.380365    two
2013-01-04  0.070610 -0.539253 -0.088252  0.056645  three
2013-01-05  0.775275 -0.722332  0.188264  0.495373   four
2013-01-06  0.109043  1.232773  2.202899  0.628963  three

In [30]:
df2['E'].isin(['two', 'four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [31]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.683755  1.207175  0.756198 -1.380365   two
2013-01-05  0.775275 -0.722332  0.188264  0.495373  four

In [32]:
df

                   A         B         C         D
2013-01-01  0.818187  1.212508 -0.079337 -1.398542
2013-01-02  0.064196  0.339498 -0.665702  0.449547
2013-01-03  0.683755  1.207175  0.756198 -1.380365
2013-01-04  0.070610 -0.539253 -0.088252  0.056645
2013-01-05  0.775275 -0.722332  0.188264  0.495373
2013-01-06  0.109043  1.232773  2.202899  0.628963

In [33]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.818187  1.212508 -0.079337 -1.398542
2013-01-02  0.882383  1.552007 -0.745039 -0.948994
2013-01-03  1.566138  2.759182  0.011160 -2.329359
2013-01-04  1.636748  2.219928 -0.077092 -2.272714
2013-01-05  2.412023  1.497596  0.111172 -1.777341
2013-01-06  2.521066  2.730369  2.314071 -1.148377

In [34]:
df.apply(lambda x: x.max() - x.min())

A    0.753991
B    1.955105
C    2.868601
D    2.027505
dtype: float64